; domain
(define (domain industrial_manufacturing2)
    (:requirements :strips :typing :numeric-fluents)
    
    (:types
        location box content agent workstation content-type carrier - object
    )

    (:predicates
        (at-box ?box - box ?loc - location)
        (at-agent ?agent - agent ?loc - location)
        (at-ws ?ws - workstation ?loc - location)
        (at-content ?content - content ?loc - location)
        (connected ?loc1 ?loc2 - location)
        (empty ?box - box)
        (filled ?box - box ?content - content)
        (box-at-workstation ?ws - workstation ?box - box)
        (content-at-workstation ?ws - workstation ?t - content-type)
        ;(workstation-needs ?ws - workstation ?content - content)
        (box-at-carrier ?carrier - carrier ?box - box)
        (carrier-at-agent ?agent - agent ?carrier - carrier)
        (is-type ?content - content ?t - content-type)
    )

    (:functions
        (capacity ?carrier - carrier)- number
        (amount ?carrier - carrier) - number
    )

    ;Si procede a definire la action relativa al ritiro di una box da una location.
    ;I parametri utili alla action in oggetto sono: la location, la scatola da ritirare e l'agente robotico.
    (:action pick-up
        :parameters (?loc - location ?box - box ?agent - agent ?carrier - carrier)
        ;Le precondizioni che consentono l'esecuzione prevedono che:
        ;-l'agente robotico non sia occupato
        ;-l'agente robotico si trovi nella location inserita come parametro
        ;-la box si trovi nella location inserita come parametro
        :precondition (and
            (carrier-at-agent ?agent ?carrier)
            (< (amount ?carrier) (capacity ?carrier))
            (at-agent ?agent ?loc)
            (at-box ?box ?loc)
        )
        ;Gli effetti dell'esecuzione portano ad uno stato in cui:
        ;-l'agente robotico non è più libero e porta la box inserita come parametro
        ;-la box non risulta più alla location
        :effect (and
            (increase (amount ?carrier) 1)
            (box-at-carrier ?carrier ?box)
            (not (at-box ?box ?loc))
        )
    )

    ;Si procede a definire la action relativa allo spostamento di un agente da una location all'altra.
    ;I parametri utili alla action in oggetto sono: le location (from e to) e l'agente robotico coinvolto.
    (:action move
        :parameters (?from ?to - location ?agent - agent)
        ;Le precondizioni che consentono l'esecuzione prevedono che:
        ;-l'agente robotico si trovi nella location di partenza
        ;-le locations siano connesse
        :precondition (and
            (at-agent ?agent ?from)
            (connected ?from ?to)
        )
        ;Gli effetti dell'esecuzione portano ad uno stato in cui:
        ;-l'agente robotico non si trovi nella location di partenza
        ;-l'agente robotico si trovi nella location di arrivo
        :effect (and
            (not (at-agent ?agent ?from))
            (at-agent ?agent ?to)
        )
    )

    ;Si procede a definire la action relativa alla consegna di una box ad una workstation.
    ;I parametri utili alla action in oggetto sono: la box da consegnare, il contenuto della box, la workstation
    ;a cui consegnare la box, la location in cui si trova la workstation e l'agente robotico coinvolto.
    (:action deliver
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?location - location ?agent - agent ?carrier - carrier)
        ;Le precondizioni che consentono l'esecuzione prevedono che:
        ;-l'agente robotico si trovi nella stessa location della workstation a cui consegnare la box
        ;-l'agente robotico stia portando la box da consegnare
        ;-la box abbia un contenuto necessario alla workstation
        :precondition (and
            (carrier-at-agent ?agent ?carrier)
            (is-type ?content ?t)
            (at-agent ?agent ?location)
            (box-at-carrier ?carrier ?box)
            (at-ws ?ws ?location)
            (filled ?box ?content)
            ;(workstation-needs ?ws ?content)
        )
        ;Gli effetti dell'esecuzione portano ad uno stato in cui:
        ;-l'agente robotico non porta più la box
        ;-la workstation non ha più bisogno del contenuto della box
        ;-la box si trova nella workstation a cui è stata consegnata
        :effect (and 
            (not (box-at-carrier ?carrier ?box))
            (decrease (amount ?carrier) 1)
            (box-at-workstation ?ws ?box)
            ;(not (workstation-needs ?ws ?content))
        )
    )

    ;Si procede a definire la action relativa al riempimento di una box con un contenuto.
    ;I parametri utili alla action in oggetto sono: la box da riempire, il contenuto della box, la location
    ;in cui si trova il contenuto e l'agente robotico coinvolto.
    (:action fill
        :parameters (?box - box ?content - content ?t - content-type ?loc - location ?agent - agent ?carrier - carrier)
        ;Le precondizioni che consentono l'esecuzione prevedono che:
        ;-la box sia vuota
        ;-l'agente robotico stia portando la box da riempire
        ;-il contenuto e l'agente robotico si trovino nella stessa location
        :precondition (and
            (carrier-at-agent ?agent ?carrier)
            (is-type ?content ?t)
            (empty ?box)
            (box-at-carrier ?carrier ?box)
            (at-content ?content ?loc)
            (at-agent ?agent ?loc)
        )
        ;Gli effetti dell'esecuzione portano ad uno stato in cui:
        ;-la box non è più vuota
        ;-la box è riempita con il contenuto
        ;-il contenuto non si trova più nella location
        :effect (and
            (not (empty ?box))
            (filled ?box ?content)
            (not (at-content ?content ?loc))
        )
    )

    ;Si procede a definire la action relativa allo svuotamento di una box.
    ;I parametri utili alla action in oggetto sono: la box da svuotare, il contenuto della box,
    ;la workstation che riceve il contenuto, l'agente robotico coinvolto e la location.
    (:action empty 
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?agent - agent ?loc - location)
        ;Le precondizioni che consentono l'esecuzione prevedono che:
        ;-l'agente non sia impegnato
        ;-la box sia riempita con il contenuto da consegnare
        ;-la box si trovi nella workstation che deve ricevere il contenuto
        ;-l'agente e la workstation si trovino nella stessa locazione
        :precondition (and
            (is-type ?content ?t)
            (filled ?box ?content)
            (box-at-workstation ?ws ?box)
            (at-agent ?agent ?loc)
            (at-ws ?ws ?loc)
        )
        ;Gli effetti dell'esecuzione portano ad uno stato in cui:
        ;-la box non ha più contenuto
        ;-la box viene rilasciata nella locazione
        ;-la workstation ha il contenuto della box
        :effect (and 
            (not (filled ?box ?content))
            (empty ?box)
            (at-box ?box ?loc)
            (content-at-workstation ?ws ?t)
        )
    )

  

)

; problem
(define
    (problem instance2)
    (:domain industrial_manufacturing2)

    (:objects
        central_warehouse loc1 loc2 loc3 - location
        ws1 ws2 ws3 ws4 - workstation
        b1 b2 b3 b4 b5 - box
        a1 a2 - agent
        c1 c2 - carrier
        valve1 valve2 bolt1 bolt2 bolt3 tool1 - content
        valve bolt tool - content-type
    )

    (:init
        (is-type valve1 valve)
        (is-type valve2 valve)
        (is-type bolt1 bolt)
        (is-type bolt2 bolt)
        (is-type bolt3 bolt)
        (is-type tool1 tool)
        (at-box b1 central_warehouse)
        (at-box b2 central_warehouse)
        (at-box b3 central_warehouse)
        (at-box b4 central_warehouse)
        (at-box b5 central_warehouse)
        (at-content valve1 central_warehouse)
        (at-content valve2 central_warehouse)
        (at-content bolt1 central_warehouse)
        (at-content bolt2 central_warehouse)
        (at-content bolt3 central_warehouse)
        (at-content tool1 central_warehouse)
        (at-ws ws1 loc1)
        (at-ws ws2 loc2)
        (at-ws ws3 loc3)
        (at-ws ws4 loc3)
        (at-agent a1 central_warehouse)
        (at-agent a2 central_warehouse)
        (connected central_warehouse loc1)
        (connected central_warehouse loc2)
        (connected central_warehouse loc3)
        (connected loc1 central_warehouse)
        (connected loc2 central_warehouse)
        (connected loc3 central_warehouse)
        (empty b1)
        (empty b2)
        (carrier-at-agent a1 c1)
        (carrier-at-agent a2 c2)
        (= (capacity c1) 3)
        (= (capacity c2) 3)
        (= (amount c1) 0)
        (= (amount c2) 0)
    )

    (:goal
        (and
            (content-at-workstation ws1 bolt)
            (content-at-workstation ws2 valve)
            (content-at-workstation ws2 bolt)
            (content-at-workstation ws3 valve)
            (content-at-workstation ws3 bolt)
            (content-at-workstation ws4 tool)
        )
    )
)

; plan
1. (pick-up central_warehouse b1 a2 c2)
   deleted: (at-box b1 central_warehouse)
   added: (box-at-carrier c2 b1)
   changed: (amount c2) from 0 to 1
   goals met: 0 of 6
2. (fill b1 bolt2 bolt central_warehouse a2 c2)
   deleted: (empty b1) (at-content bolt2 central_warehouse)
   added: (filled b1 bolt2)
   goals met: 0 of 6
3. (move central_warehouse loc2 a2)
   deleted: (at-agent a2 central_warehouse)
   added: (at-agent a2 loc2)
   goals met: 0 of 6
4. (deliver b1 bolt2 bolt ws2 loc2 a2 c2)
   deleted: (box-at-carrier c2 b1)
   added: (box-at-workstation ws2 b1)
   changed: (amount c2) from 1 to 0
   goals met: 0 of 6
5. (pick-up central_warehouse b2 a1 c1)
   deleted: (at-box b2 central_warehouse)
   added: (box-at-carrier c1 b2)
   changed: (amount c1) from 0 to 1
   goals met: 0 of 6
6. (move central_warehouse loc2 a1)
   deleted: (at-agent a1 central_warehouse)
   added: (at-agent a1 loc2)
   goals met: 0 of 6
7. (empty b1 bolt2 bolt ws2 a1 loc2)
   deleted: (filled b1 bolt2)
   added: (empty b1) (at-box b1 loc2) (content-at-workstation ws2 bolt)
   goals met: 1 of 6
8. (pick-up loc2 b1 a1 c1)
   deleted: (at-box b1 loc2)
   added: (box-at-carrier c1 b1)
   changed: (amount c1) from 1 to 2
   goals met: 1 of 6
9. (move loc2 central_warehouse a1)
   deleted: (at-agent a1 loc2)
   added: (at-agent a1 central_warehouse)
   goals met: 1 of 6
10. (fill b1 bolt1 bolt central_warehouse a1 c1)
   deleted: (empty b1) (at-content bolt1 central_warehouse)
   added: (filled b1 bolt1)
   goals met: 1 of 6
11. (move central_warehouse loc3 a1)
   deleted: (at-agent a1 central_warehouse)
   added: (at-agent a1 loc3)
   goals met: 1 of 6
12. (deliver b1 bolt1 bolt ws3 loc3 a1 c1)
   deleted: (box-at-carrier c1 b1)
   added: (box-at-workstation ws3 b1)
   changed: (amount c1) from 2 to 1
   goals met: 1 of 6
13. (empty b1 bolt1 bolt ws3 a1 loc3)
   deleted: (filled b1 bolt1)
   added: (empty b1) (at-box b1 loc3) (content-at-workstation ws3 bolt)
   goals met: 2 of 6
14. (pick-up loc3 b1 a1 c1)
   deleted: (at-box b1 loc3)
   added: (box-at-carrier c1 b1)
   changed: (amount c1) from 1 to 2
   goals met: 2 of 6
15. (move loc3 central_warehouse a1)
   deleted: (at-agent a1 loc3)
   added: (at-agent a1 central_warehouse)
   goals met: 2 of 6
16. (fill b1 valve1 valve central_warehouse a1 c1)
   deleted: (empty b1) (at-content valve1 central_warehouse)
   added: (filled b1 valve1)
   goals met: 2 of 6
17. (move central_warehouse loc2 a1)
   deleted: (at-agent a1 central_warehouse)
   added: (at-agent a1 loc2)
   goals met: 2 of 6
18. (deliver b1 valve1 valve ws2 loc2 a1 c1)
   deleted: (box-at-carrier c1 b1)
   changed: (amount c1) from 2 to 1
   goals met: 2 of 6
19. (empty b1 valve1 valve ws2 a1 loc2)
   deleted: (filled b1 valve1)
   added: (empty b1) (at-box b1 loc2) (content-at-workstation ws2 valve)
   goals met: 3 of 6
20. (pick-up loc2 b1 a1 c1)
   deleted: (at-box b1 loc2)
   added: (box-at-carrier c1 b1)
   changed: (amount c1) from 1 to 2
   goals met: 3 of 6
21. (move loc2 central_warehouse a1)
   deleted: (at-agent a1 loc2)
   added: (at-agent a1 central_warehouse)
   goals met: 3 of 6
22. (fill b2 tool1 tool central_warehouse a1 c1)
   deleted: (empty b2) (at-content tool1 central_warehouse)
   added: (filled b2 tool1)
   goals met: 3 of 6
23. (fill b1 valve2 valve central_warehouse a1 c1)
   deleted: (empty b1) (at-content valve2 central_warehouse)
   added: (filled b1 valve2)
   goals met: 3 of 6
24. (move central_warehouse loc3 a1)
   deleted: (at-agent a1 central_warehouse)
   added: (at-agent a1 loc3)
   goals met: 3 of 6
25. (deliver b2 tool1 tool ws4 loc3 a1 c1)
   deleted: (box-at-carrier c1 b2)
   added: (box-at-workstation ws4 b2)
   changed: (amount c1) from 2 to 1
   goals met: 3 of 6
26. (empty b2 tool1 tool ws4 a1 loc3)
   deleted: (filled b2 tool1)
   added: (empty b2) (at-box b2 loc3) (content-at-workstation ws4 tool)
   goals met: 4 of 6
27. (deliver b1 valve2 valve ws3 loc3 a1 c1)
   deleted: (box-at-carrier c1 b1)
   changed: (amount c1) from 1 to 0
   goals met: 4 of 6
28. (empty b1 valve2 valve ws3 a1 loc3)
   deleted: (filled b1 valve2)
   added: (empty b1) (at-box b1 loc3) (content-at-workstation ws3 valve)
   goals met: 5 of 6
29. (move loc2 central_warehouse a2)
   deleted: (at-agent a2 loc2)
   added: (at-agent a2 central_warehouse)
   goals met: 5 of 6
30. (move central_warehouse loc3 a2)
   deleted: (at-agent a2 central_warehouse)
   added: (at-agent a2 loc3)
   goals met: 5 of 6
31. (pick-up loc3 b2 a2 c2)
   deleted: (at-box b2 loc3)
   added: (box-at-carrier c2 b2)
   changed: (amount c2) from 0 to 1
   goals met: 5 of 6
32. (move loc3 central_warehouse a2)
   deleted: (at-agent a2 loc3)
   added: (at-agent a2 central_warehouse)
   goals met: 5 of 6
33. (fill b2 bolt3 bolt central_warehouse a2 c2)
   deleted: (empty b2) (at-content bolt3 central_warehouse)
   added: (filled b2 bolt3)
   goals met: 5 of 6
34. (move central_warehouse loc1 a2)
   deleted: (at-agent a2 central_warehouse)
   added: (at-agent a2 loc1)
   goals met: 5 of 6
35. (deliver b2 bolt3 bolt ws1 loc1 a2 c2)
   deleted: (box-at-carrier c2 b2)
   added: (box-at-workstation ws1 b2)
   changed: (amount c2) from 1 to 0
   goals met: 5 of 6
36. (empty b2 bolt3 bolt ws1 a2 loc1)
   deleted: (filled b2 bolt3)
   added: (empty b2) (at-box b2 loc1) (content-at-workstation ws1 bolt)
   goals met: 6 of 6
